In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [2]:
import pandas as pd

### create dataframe

In [4]:
raw_data = {
           'city':['Tripoli', 'Sydney', 'Tripoli', 'Rome', 'Rome', 'Tripoli', 'Rome', 'Sydney', 'Sydney'],
           'rank':['1st', '2nd', '1st', '2nd', '1st', '2nd', '1st', '2nd', '1st'],
           'score1':[44, 48, 39, 41, 38, 44, 34, 54, 61],
           'score2':[67, 63, 55, 70, 64, 75, 45, 66, 72]
           }

df = pd.DataFrame(raw_data,
                  index = pd.Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'], name='letter'),
                  columns = pd.Index(['city', 'rank', 'score1', 'score2'], name='attributes')
                  )
df

attributes     city rank  score1  score2
letter
A           Tripoli  1st      44      67
B            Sydney  2nd      48      63
C           Tripoli  1st      39      55
D              Rome  2nd      41      70
E              Rome  1st      38      64
F           Tripoli  2nd      44      75
G              Rome  1st      34      45
H            Sydney  2nd      54      66
I            Sydney  1st      61      72

### `replace` values in a column

In [6]:
type(df['city'])
df['city']

pandas.core.series.Series

letter
A    Tripoli
B     Sydney
C    Tripoli
D       Rome
E       Rome
F    Tripoli
G       Rome
H     Sydney
I     Sydney
Name: city, dtype: object

In [7]:
df['city'].replace('Rome','Napoli')

letter
A    Tripoli
B     Sydney
C    Tripoli
D     Napoli
E     Napoli
F    Tripoli
G     Napoli
H     Sydney
I     Sydney
Name: city, dtype: object

In [8]:
df['city'].replace('Rome','Napoli', inplace=True)
df

attributes     city rank  score1  score2
letter
A           Tripoli  1st      44      67
B            Sydney  2nd      48      63
C           Tripoli  1st      39      55
D            Napoli  2nd      41      70
E            Napoli  1st      38      64
F           Tripoli  2nd      44      75
G            Napoli  1st      34      45
H            Sydney  2nd      54      66
I            Sydney  1st      61      72

In [9]:
df['city'].replace(['Napoli','Tripoli'] , ['Rome','Benghazi'], inplace=True)
df

attributes      city rank  score1  score2
letter
A           Benghazi  1st      44      67
B             Sydney  2nd      48      63
C           Benghazi  1st      39      55
D               Rome  2nd      41      70
E               Rome  1st      38      64
F           Benghazi  2nd      44      75
G               Rome  1st      34      45
H             Sydney  2nd      54      66
I             Sydney  1st      61      72

### access individual value

In [10]:
df.iloc[0][0]

'Benghazi'

In [12]:
df.iloc[2,3]

55

In [13]:
df.loc['B','city']

'Sydney'

In [14]:
df.loc['B']['city']

'Sydney'

### change individual value
use `loc`; `iloc` gives error

In [17]:
df.loc['B','city'] = 'Berlin'
df.loc['B','city']

'Berlin'

In [18]:
df

attributes      city rank  score1  score2
letter
A           Benghazi  1st      44      67
B             Berlin  2nd      48      63
C           Benghazi  1st      39      55
D               Rome  2nd      41      70
E               Rome  1st      38      64
F           Benghazi  2nd      44      75
G               Rome  1st      34      45
H             Sydney  2nd      54      66
I             Sydney  1st      61      72